# CreatePartsWithInvalidService Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SystemsFailures..::..CreatePartsWithInvalidService Property
BuiltInFailures..::..SystemsFailures Class See Also
---
Parts were not created because a system's service is undefined.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CreatePartsWithInvalidService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CreatePartsWithInvalidService As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CreatePartsWithInvalidService {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SystemsFailures Class
Autodesk.Revit.DB Namespace